# CurrentElementId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkIterator..::..CurrentElementId Property
MEPNetworkIterator Class See Also
---
The element id at the current iteration step.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ElementId CurrentElementId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurrentElementId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ CurrentElementId {
	ElementId^ get ();
}
```

# See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace